In [124]:
import pandas as pd

def nth_highest_salary(employee: pd.DataFrame, N: int) -> pd.DataFrame:
    sorted = employee.drop_duplicates('salary').copy()
    sorted.sort_values('salary',inplace=True, ascending=False)
    name = 'getNthHighestSalary(' + str(N) + ')'
    if (N > len(sorted)) | (N <= 0):
        return pd.DataFrame({name:[None]})
    else:
        return pd.DataFrame({name:[sorted.iloc[N-1].salary]})

In [125]:
employee = pd.DataFrame({'id':[1,2,3,4,5,6,7,8,9],'salary':[100,200,300,100,500,600,400,200,800]})
employee.sort_values('salary', ascending=False)

   id  salary
8   9     800
5   6     600
4   5     500
6   7     400
2   3     300
1   2     200
7   8     200
0   1     100
3   4     100

In [126]:
employee1 = pd.DataFrame({'id':[1],'salary':[100]})

In [127]:
nth_highest_salary(employee1,2)

  getNthHighestSalary(2)
0                   None